Repository: Steph-Krs/ianseo-launcher-exe-dev
Catalog: IANSEO_Launcher/Properties/Resources.*.resx
Languages: de, es, fr, it

# btnStartOpen_Run
source: ▶️ Start IANSEO
de: ▶️ IANSEO starten
es: ▶️ Iniciar IANSEO
fr: ▶️ Démarrer IANSEO
it: ▶️ Avvia IANSEO

# btnStop
source: ⏸️ Stop IANSEO
de: ⏸️ IANSEO stoppen
es: ⏸️ Detener IANSEO
fr: ⏸️ Arrêter IANSEO
it: ⏸️ Ferma IANSEO

# btnShowQR
source: 📸 QR-Code
es: 📸 Código QR
it: 📸 Codice QR

# lblStatusTitle
source: Service status
de: Status der Dienste
es: Estado de los servicios
fr: État des services
it: Stato dei servizi

# lblAddressTitle
source: IANSEO server address
de: Adresse des Ianseo-Servers
es: Dirección del servidor Ianseo
fr: Adresse du serveur Ianseo
it: Indirizzo del server Ianseo

# btnStartOpen_Open
source: 🌐 Open IANSEO
de: 🌐 IANSEO öffnen
es: 🌐 Abrir IANSEO
fr: 🌐 Ouvrir IANSEO
it: 🌐 Apri IANSEO

# btnStartOpen_Starting
source: ⏳ Starting...
de: ⏳ Starte...
es: ⏳ Inicio en curso...
fr: ⏳ Démarrage en cours...
it: ⏳ Avvio in corso...

# lblErrorOpenBrowser
source: Error opening browser:
de: Fehler beim Öffnen des Browsers:
es: Error al abrir el navegador:
fr: Erreur ouverture navigateur :
it: Errore apertura browser:

# btnStop_Stopping
source: ⏳ Stopping...
de: ⏳ Stoppen...
es: ⏳ Deteniendo...
fr: ⏳ Arrêt en cours...
it: ⏳ Arresto in corso...

# lblErrorExecution
source: Error during execution:
de: Fehler bei der Ausführung:
es: Error de ejecución:
fr: Erreur exécution :
it: Errore esecuzione:

# lblErrorOpenBrowserAlt
source: Error opening the browser:
de: Fehler beim Öffnen des Browsers:
es: Error al abrir el navegador:
fr: Erreur lors de l'ouverture du navigateur :
it: Errore durante l'apertura del browser:

# lblLinkCopied
source: Link copied to clipboard
de: Link in Zwischenablage kopiert
es: Enlace copiado al portapapeles
fr: Lien copié dans le presse-papier
it: Link copiato negli appunti

# lblErrorLinkCopied
source: Error during copy:
de: Fehler beim Kopieren:
es: Error al copiar:
fr: Erreur lors de la copie :
it: Errore durante la copia:

# lblShowQRTitle
source: IANSEO QR Code
es: Código QR IANSEO
fr: QR Code IANSEO
it: Codice QR IANSEO

# lblErrorShowQR
source: Error generating QR code:
de: Fehler bei der QR-Code-Erstellung:
es: Error al generar el código QR:
fr: Erreur lors de la génération du QR code :
it: Errore durante la generazione del codice QR:

# btnCopyLink
source: 🔗 Copy
de: 🔗 Kopieren
es: 🔗 Copiar
fr: 🔗 Copier
it: 🔗 Copia

# lblLinkCopiedTitle
source: Copied
de: Kopiert
es: Copiado
fr: Copié
it: Copiato

# lblErrorOpenXamppControl
source: Error opening XAMPP Control:
de: Fehler beim Öffnen von XAMPP Control:
es: Error al abrir XAMPP Control:
fr: Erreur lors de l'ouverture de XAMPP Control :
it: Errore nell'apertura di XAMPP Control:

# btnOpenXamppControl
source: Open XAMPP Control
de: XAMPP Control starten
es: Iniciar XAMPP Control
fr: Ouvrir XAMPP Control
it: Avvia XAMPP Control

# lblErrorInvalidDirectory
source: IANSEO.exe is not in the "ianseo\" folder or "Xampp-control.exe" is missing. Usually, the "ianseo\" folder is located in "C:\" as recommended during installation. Please place this executable in that folder and make sure that Xampp-control.exe is also present in the same folder.
de: IANSEO.exe befindet sich nicht im Ordner "ianseo\" oder "Xampp-control.exe" fehlt. In der Regel befindet sich der Ordner "ianseo\" im Verzeichnis "C:\", wie während der Installation empfohlen. Bitte legen Sie diese ausführbare Datei in diesen Ordner und stellen Sie sicher, dass Xampp-control.exe ebenfalls in demselben Ordner vorhanden ist.
es: IANSEO.exe no está en la carpeta "ianseo\" o falta "Xampp-control.exe". Normalmente, la carpeta "ianseo\" se encuentra en "C:\" como se recomienda durante la instalación. Por favor, coloque este ejecutable en esa carpeta y asegúrese de que Xampp-control.exe también esté presente en la misma carpeta.
fr: IANSEO.exe n'est pas dans le dossier "ianseo\" ou "Xampp-control.exe" est manquant. Habituellement, le dossier "ianseo\" se trouve dans "C:\" comme recommandé lors de l'installation. Veuillez placer cette exécutable dans ce dossier et vous assurer que Xampp-control.exe est également présent dans ce même dossier.
it: IANSEO.exe non si trova nella cartella "ianseo\" oppure manca "Xampp-control.exe". Di solito la cartella "ianseo\" si trova in "C:\", come raccomandato durante l’installazione. Si prega di inserire questo eseguibile in quella cartella e assicurarsi che anche Xampp-control.exe sia presente nella stessa cartella.

# lblErrorInvalidDirectoryTitle
source: Invalid Directory
de: Ungültiges Verzeichnis
es: Directorio no válido
fr: Répertoire invalide
it: Directory non valida

# btnClose
source: Close IANSEO
de: IANSEO schließen
es: Cerrar IANSEO
fr: Fermer IANSEO
it: Chiudi IANSEO

# lblRepairTitle
source: 🔧 Problem solving
de: 🔧 Problembehebung
es: 🔧 Solución de problemas
fr: 🔧 Résolution de problèmes
it: 🔧 Risoluzione dei problemi

# lblAdminMessage
source: Please run this program as an administrator to access advanced options.
de: Bitte führen Sie dieses Programm als Administrator aus, um auf erweiterte Optionen zuzugreifen.
es: Ejecute este programa como administrador para acceder a las opciones avanzadas.
fr: Veuillez exécuter ce programme en tant qu’administrateur pour accéder aux options avancées.
it: Eseguire questo programma come amministratore per accedere alle opzioni avanzate.

# btnRunAsAdmin
source: 🛡️ Open as administrator
de: 🛡️ Als Administrator öffnen
es: 🛡️ Abrir como administrador
fr: 🛡️ Ouvrir en tant qu'administrateur
it: 🛡️ Apri come amministratore

# btnRepairMySQL
source: 🧰 Repair MySQL
de: 🧰 MySQL reparieren
es: 🧰 Reparar MySQL
fr: 🧰 Réparer MySQL
it: 🧰 Ripara MySQL

# btnEnableStartup
source: 🔄️ Run IANSEO at every startup
de: 🔄️ IANSEO bei jedem Start ausführen
es: 🔄️ Ejecutar IANSEO en cada inicio
fr: 🔄️ Lancer IANSEO à chaque démarrage
it: 🔄️ Eseguire IANSEO a ogni avvio

# btnWindowsDefender
source: 🛡️ Limit Windows problems
de: 🛡️ Windows-Probleme begrenzen
es: 🛡️ Limitar problemas de Windows
fr: 🛡️ Limiter les problèmes Windows
it: 🛡️ Limitare i problemi di Windows

# lblWindowsDefenderExclusionsTitle
source: Windows Defender exclusions
de: Windows-Defender-Ausnahmen
es: Exclusiones de Windows Defender
fr: Exclusions Windows Defender
it: Esclusioni di Windows Defender

# lblWindowsDefenderExclusions
source: Exclusions have been added to Windows Defender. This will help reduce blocking issues with Apache or MySQL.
de: Ausnahmen wurden zu Windows Defender hinzugefügt. Dies wird helfen, Blockierungsprobleme mit Apache oder MySQL zu reduzieren.
es: Las exclusiones se han añadido a Windows Defender. Esto ayudará a reducir los bloqueos de Apache o MySQL.
fr: Les exclusions ont été ajoutées à Windows Defender. Cela permettra de limiter les blocages d’Apache ou MySQL.
it: Le esclusioni sono state aggiunte a Windows Defender. Questo aiuterà a ridurre i blocchi di Apache o MySQL.

# lblError
source: Error
de: Fehler
fr: Erreur
it: Errore

# lblErrorWindowsDefenderExclusions
source: Error while adding exclusions:
de: Fehler beim Hinzufügen der Ausnahmen:
es: Error al agregar las exclusiones:
fr: Erreur lors de l’ajout des exclusions :
it: Errore durante l'aggiunta delle esclusioni:

# lblErrorRunAsAdmin
source: Unable to restart in administrator mode:
de: Neustart im Administrator-Modus nicht möglich:
es: No es posible reiniciar en modo administrador:
fr: Impossible de relancer en mode administrateur :
it: Impossibile riavviare in modalità amministratore:

# lblErrorStopNotAdministrator
source: Ianseo is running through Windows services. Please restart the Launcher in administrator mode to properly stop Apache and MySQL.
de: Ianseo wird über die Windows-Dienste ausgeführt. Bitte starten Sie den Launcher im Administrator-Modus neu, um Apache und MySQL ordnungsgemäß zu stoppen.
es: Ianseo se está ejecutando a través de los servicios de Windows. Reinicie el Launcher en modo administrador para detener correctamente Apache y MySQL.
fr: Ianseo s'exécute via les services Windows. Veuillez relancer le Launcher en mode administrateur pour pouvoir arrêter correctement Apache et MySQL.
it: Ianseo è in esecuzione tramite i servizi Windows. Riavviare il Launcher in modalità amministratore per arrestare correttamente Apache e MySQL.

# lblErrorXamppIni
source: The file xampp-control.ini was not found.
de: Die Datei xampp-control.ini wurde nicht gefunden.
es: No se encontró el archivo xampp-control.ini.
fr: Le fichier xampp-control.ini est introuvable.
it: Il file xampp-control.ini non è stato trovato.

# lblSetAsServiceTitle
source: Services enabled
de: Dienste aktiviert
es: Servicios activados
fr: Services activés
it: Servizi attivati

# lblSetAsService
source: Configuration complete: xampp-control.ini updated and Ianseo_Apache/Ianseo_MySQL services created and enabled.
de: Konfiguration abgeschlossen: xampp-control.ini aktualisiert und die Dienste Ianseo_Apache/Ianseo_MySQL erstellt und aktiviert.
es: Configuración completada: xampp-control.ini actualizado y los servicios Ianseo_Apache/Ianseo_MySQL creados y activados.
fr: Configuration terminée : xampp-control.ini mis à jour et services Ianseo_Apache/Ianseo_MySQL créés et activés.
it: Configurazione completata: xampp-control.ini aggiornato e i servizi Ianseo_Apache/Ianseo_MySQL creati e attivati.

# lblErrorSetAsService
source: Error while configuring services:
de: Fehler bei der Konfiguration der Dienste:
es: Error al configurar los servicios:
fr: Erreur lors de la configuration des services :
it: Errore durante la configurazione dei servizi:

# lblErrorMysqlDir
source: MySQL folder not found:
de: MySQL-Ordner nicht gefunden:
es: Carpeta MySQL no encontrada:
fr: Dossier MySQL introuvable :
it: Cartella MySQL non trovata:

# lblErrorDataDir
source: Data folder not found in:
de: Ordner data nicht gefunden in:
es: Carpeta data no encontrada en:
fr: Dossier data introuvable dans :
it: Cartella data non trovata in:

# lblErrorBackupDir
source: Unable to restore. Backup folder 'backup' not found in:
de: Wiederherstellung nicht möglich. Sicherungsordner 'backup' nicht gefunden in:
es: No es posible restaurar. La carpeta de respaldo 'backup' no se encontró en:
fr: Impossible de restaurer. Dossier de sauvegarde 'backup' introuvable dans :
it: Impossibile ripristinare. La cartella di backup 'backup' non è stata trovata in:

# lblErrorIbdataPath
source: ibdata1 file not found in data. Repair impossible.
de: Datei ibdata1 im Ordner data nicht gefunden. Reparatur nicht möglich.
es: El archivo ibdata1 no se encontró en data. Reparación imposible.
fr: Fichier ibdata1 introuvable dans data. Réparation impossible.
it: File ibdata1 non trovato in data. Riparazione impossibile.

# lblErrorDelDataOldDir
source: Unable to delete the old data_old folder:
de: Der alte Ordner data_old kann nicht gelöscht werden:
es: No se puede eliminar la carpeta antigua data_old:
fr: Impossible de supprimer l'ancien dossier data_old :
it: Impossibile eliminare la vecchia cartella data_old:

# lblErrorRenameDataDir
source: Unable to rename 'data' to 'data_old':
de: Umbenennen von 'data' in 'data_old' nicht möglich:
es: No se puede renombrar 'data' a 'data_old':
fr: Impossible de renommer 'data' en 'data_old' :
it: Impossibile rinominare 'data' in 'data_old':

# lblErrorCopyBackupDir
source: Error while copying the backup folder to data:
de: Fehler beim Kopieren des Backup-Ordners nach data:
es: Error al copiar la carpeta backup a data:
fr: Erreur lors de la copie du dossier backup vers data :
it: Errore durante la copia della cartella backup in data:

# lblErrorDataOldDir
source: The data_old folder cannot be found after renaming. Operation cancelled.
de: Der Ordner data_old kann nach der Umbenennung nicht gefunden werden. Vorgang abgebrochen.
es: La carpeta data_old no se encuentra después del cambio de nombre. Operación cancelada.
fr: Le dossier data_old est introuvable après le renommage. Opération annulée.
it: La cartella data_old non è stata trovata dopo la rinomina. Operazione annullata.

# lblErrorCopyDataOldDir
source: Error while copying folders from data_old:
de: Fehler beim Kopieren der Ordner aus data_old:
es: Error al copiar carpetas desde data_old:
fr: Erreur lors de la copie des dossiers depuis data_old :
it: Errore durante la copia delle cartelle da data_old:

# lblErrorCopyIbdata1
source: Error while copying ibdata1:
de: Fehler beim Kopieren von ibdata1:
es: Error al copiar ibdata1:
fr: Erreur lors de la copie de ibdata1 :
it: Errore durante la copia di ibdata1:

# lblWarning
source: Warning
de: Achtung
es: Atención
fr: Attention
it: Attenzione

# lblWarningIbdata1
source: ibdata1 not found in data_old. Recovery may fail.
de: ibdata1 wurde in data_old nicht gefunden. Die Wiederherstellung könnte fehlschlagen.
es: ibdata1 no se encontró en data_old. La recuperación puede fallar.
fr: ibdata1 introuvable dans data_old. La récupération peut échouer.
it: ibdata1 non trovato in data_old. Il ripristino potrebbe fallire.

# lblErrorXamppRestart
source: Error while restarting XAMPP:
de: Fehler beim Neustart von XAMPP:
es: Error al reiniciar XAMPP:
fr: Erreur lors du redémarrage de XAMPP :
it: Errore durante il riavvio di XAMPP:

# lblErrorMySQL
source: MySQL error:
de: MySQL-Fehler:
es: Error de MySQL:
fr: Erreur MySQL :
it: Errore MySQL:

# lblMySQLRepaired
source: The user 'ianseo' has been recreated and privileges have been granted successfully.
de: Der Benutzer 'ianseo' wurde neu erstellt und die Berechtigungen wurden erfolgreich vergeben.
es: El usuario 'ianseo' ha sido recreado y los privilegios se han otorgado correctamente.
fr: L'utilisateur 'ianseo' a été recréé et les privilèges ont été accordés avec succès.
it: L’utente 'ianseo' è stato ricreato e i privilegi sono stati assegnati con successo.

# lblMySQLRepairedTitle
source: MySQL repaired
de: MySQL repariert
es: MySQL reparado
fr: MySQL réparé
it: MySQL riparato

# lblWarningMysqlBin
source: The SQL commands will need to be executed manually. mysql.exe not found in:
de: Die SQL-Befehle müssen manuell ausgeführt werden. mysql.exe nicht gefunden in:
es: Los comandos SQL deberán ejecutarse manualmente. mysql.exe no encontrado en:
fr: Les commandes SQL devront être exécutées manuellement. mysql.exe introuvable dans :
it: I comandi SQL dovranno essere eseguiti manualmente. mysql.exe non trovato in:

# lblErrorMysqlUserCreation
source: Error while creating the MySQL user:
de: Fehler beim Erstellen des MySQL-Benutzers:
es: Error al crear el usuario de MySQL:
fr: Erreur lors de la création de l'utilisateur MySQL :
it: Errore durante la creazione dell’utente MySQL:

# lblErrorRepairMySQL
source: Unexpected error during MySQL repair:
de: Unerwarteter Fehler bei der MySQL-Reparatur:
es: Error inesperado durante la reparación de MySQL:
fr: Erreur inattendue lors de la réparation MySQL :
it: Errore imprevisto durante la riparazione di MySQL:
